@kevcube I used the same configuration and had the amplify app and domain created in a delegated account with the hosted zone having the NS records for the domain I own on my primary account. The 

```
resource "aws_amplify_app" "default" {
  name = "test"
}

resource "aws_amplify_branch" "default" {
  app_id      = aws_amplify_app.default.id
  branch_name = "main"
}

resource "awscc_amplify_domain" "default" {
  app_id              = aws_amplify_app.default.id
  domain_name         = "monk-stack.com"
  sub_domain_settings = [
    {
      branch_name = "main"
      prefix      = "test"
    }
  ]
}

```


```

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # aws_amplify_app.default will be created
  + resource "aws_amplify_app" "default" {
      + arn               = (known after apply)
      + build_spec        = (known after apply)
      + custom_headers    = (known after apply)
      + default_domain    = (known after apply)
      + id                = (known after apply)
      + name              = "test"
      + platform          = "WEB"
      + production_branch = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_amplify_branch.default will be created
  + resource "aws_amplify_branch" "default" {
      + app_id               = (known after apply)
      + arn                  = (known after apply)
      + associated_resources = (known after apply)
      + branch_name          = "main"
      + custom_domains       = (known after apply)
      + destination_branch   = (known after apply)
      + display_name         = (known after apply)
      + enable_auto_build    = true
      + id                   = (known after apply)
      + source_branch        = (known after apply)
      + tags_all             = (known after apply)
    }

  # awscc_amplify_domain.default will be created
  + resource "awscc_amplify_domain" "default" {
      + app_id                            = (known after apply)
      + arn                               = (known after apply)
      + auto_sub_domain_creation_patterns = (known after apply)
      + auto_sub_domain_iam_role          = (known after apply)
      + certificate                       = (known after apply)
      + certificate_record                = (known after apply)
      + certificate_settings              = (known after apply)
      + domain_name                       = "monk-stack.com"
      + domain_status                     = (known after apply)
      + enable_auto_sub_domain            = (known after apply)
      + id                                = (known after apply)
      + status_reason                     = (known after apply)
      + sub_domain_settings               = [
          + {
              + branch_name = "main"
              + prefix      = "test"
            },
        ]
      + update_status                     = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_amplify_app.default: Creating...
aws_amplify_app.default: Creation complete after 0s [id=############]
aws_amplify_branch.default: Creating...
awscc_amplify_domain.default: Creating...
aws_amplify_branch.default: Creation complete after 1s [id=############/main]
awscc_amplify_domain.default: Still creating... [10s elapsed]
awscc_amplify_domain.default: Creation complete after 13s [id=arn:aws:amplify:us-east-1:############:apps/############/domains/monk-stack.com]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```